posts/TheRudestBook.org
#+TITLE: The Rudest Book

* You are Product
- let’s concern ourselves with arming you with
  better means, methods and mechanisms to deflect and deal with shit that has
  happened to you, is happening to you and will happen to you.

- Let’s start with you. You are a product. You are a product with hope
  attached to it. What does that mean? It means that, one day, you are meant to
  become this awesome, functional unit capable of choosing jobs, careers,
  relationships, environments and economies on your own volition—that’s the
  hope. The better the choices, the better the product you are—that’s the simple
  law on the basis of which the world judges you.

  - ‘Emotional responses’ is a garbage teacher, because as a kid, the
    emotional intelligence is underdeveloped.

- Anyway, when the time comes, a lot of them will take complete
  advantage of you, rid you of your emotional innocence and turn your world
  upside down. It will most definitely happen, history tells you that, no matter
  who you are or what you do—rich, talented, genius, pretty, strong, powerful,
  polite, kind, or careful.
-
* You know you want to be special
- Specialness is the badge of realisation you earn. It may seem very
  simple to you, but this thinking can change the course of your life. Any
  achievement dictates you have created or mastered something. This means
  that not only did you gain in terms of knowledge, but you built habits of
  discipline, hard work, prioritising and focusing—habits that will serve you in
  almost all aspects of life.
- becomes a reference point for yourself in the future—I was able to achieve
  this, this is who I am— but also proves to yourself that you have what it takes
  to be capable—I believe I can achieve anything I put my mind to.

- Whatever the case may be, the right to feel special
  must be earned and must only be yours to give. It shouldn’t belong to others
  because:
- Why am I special? What
  have I done in my life?, and get a clear answer. In case you feel dissatisfied,
  then you have the option to earn it. Nobody gives it to you, you have to take
  it. But that’s the hard part, earning it.

* What Rejections do to us
- Rejections are Normal
  - Don't prove to orthers

* people are World
- People are weird
- To understand how to deal with something, you need to first figure out what
  it is you’re dealing with
- the difference between 'knowing' and 'understanding'
- Your perception of something creates expectations from them
- when you meet someone
  - data is king
  - people are weird
  - we live in era of advertising and sale
  -


* Do Failures mess you up?
** How Not To Deal with failures
- I am a fucking idiot, I am nothing, I am a loser, I don’t
  deserve anything, I deserve to die. In many cases, these feelings are
  accompanied by fear of your parents’ wrath, friends’
- This chain of self-harm needs to be broken with the knowledge that failures,
  losses and rejections are normal, and a solution that directs all those highly
 powerful negative emotions into something useful
** How Winning is done mentally
- You wanna do this, right?
  This may seem like a very simple question, but, my friend, there is a
  difference between wanting to do something and having to do something.
  Most people in this world are doing what they do not because they want to,
  but because they have to. Having to do something becomes a duty you have
  to fulfil. Wanting to do something is a choice. Therefore, to win, the very
  first thing you need to clarify in your mind is, do you really wanna do this?
*** People are successful number of reasons:
- A hunger for money , status , power
- a hunger to avoid poverty , desperation , conditions you wouldn't
  want to go back to ever again
- a hunger to prove in your own eyes that you are capable (which would
  be the concept of being special)
- a hunger to provide for those whom you love and are dependent on you


Success is a matter of choice
- What traditional winning looks like
  this is basically how society crowns a
  winner. The results of any competition declare a winner and the losers.
  Society celebrates the winner and ignores the losers
- How real winning works
  one wins after having failed time after time. Theessence behind real winning is not giving up, no matter what badges and
  medals society is handing out. When it comes to your ‘heroes’ and those who
  define success and hard work for you, you see them the same way
