posts/TheRudestBook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-21 Wed 23:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Rudest Book</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="AkashRaj" />
<link rel="stylesheet" type="text/css" href="https://blog.bugswriter.com/static/style.css"/>


</head>
<body>
<div id="content">
<h1 class="title">The Rudest Book</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge42ad1f">1. You are Product</a></li>
<li><a href="#orga7b5bab">2. You know you want to be special</a></li>
<li><a href="#org51c3826">3. What Rejections do to us</a></li>
<li><a href="#orgb38d529">4. people are World</a></li>
<li><a href="#org5a3c30e">5. Do Failures mess you up?</a>
<ul>
<li><a href="#org29960ed">5.1. How Not To Deal with failures</a></li>
<li><a href="#orgba78025">5.2. How Winning is done mentally</a>
<ul>
<li><a href="#org44fc371">5.2.1. People are successful number of reasons:</a></li>
</ul>
</li>
<li><a href="#orgfa5a69f">5.3. HOW WINNING IS DONE PRACTICALLY</a></li>
<li><a href="#org303fca8">5.4. FAILURES TEACH YOU HOW TO WIN THE WAR</a></li>
</ul>
</li>
<li><a href="#orged46966">6. Finding Love Can be a pain in the ass</a></li>
<li><a href="#org551aad1">7. How your self dies</a>
<ul>
<li><a href="#org5c2426e">7.1. the Warning</a></li>
<li><a href="#orgd04386c">7.2. The murder of individuality</a></li>
</ul>
</li>
<li><a href="#org79943f4">8. Screw Happiness</a>
<ul>
<li><a href="#org68a82fc">8.1. What is Self-Satisfaction ?</a></li>
<li><a href="#orgd7ccfaf">8.2. Why do we chase after happiness like junkies ?</a>
<ul>
<li><a href="#org4517dba">8.2.1. How happiness screws you over and over!</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb1607d2">9. Choose Satisfaction, not happiness</a>
<ul>
<li><a href="#orgcd45e27">9.1. Long-Term Happiness (Value)</a></li>
<li><a href="#org4d07cce">9.2. Short-Term Happiness (Insterest)</a></li>
</ul>
</li>
<li><a href="#org49abae6">10. Screw Pleasing People</a>
<ul>
<li><a href="#org9501469">10.1. Do you care what others think about you ??</a></li>
<li><a href="#orgcb0c2d8">10.2. Do you rely on people for the motivation ??</a></li>
</ul>
</li>
<li><a href="#org53cf5aa">11. Screw you Heroes</a>
<ul>
<li><a href="#org76e0d22">11.1. Heroes</a></li>
<li><a href="#org798478c">11.2. Why do we love Heroes ?</a></li>
<li><a href="#org1ede111">11.3. A society that funtion on &rsquo;good&rsquo; and &rsquo;bad&rsquo; is dumb ?</a></li>
<li><a href="#org55f5d8a">11.4. What it means to admire someone</a></li>
</ul>
</li>
<li><a href="#org2d5a87f">12. The Pieces of shit Online</a>
<ul>
<li><a href="#orgea40f5b">12.1. THRUTH ABOUT SOCIAL MEDIA INFLUENCERS</a></li>
<li><a href="#org61b69db">12.2. HOW TO SAVE YOURSELF FROM THIS BULLSHIT</a></li>
</ul>
</li>
<li><a href="#orgf7af2a0">13. How to Think</a></li>
<li><a href="#orgb191243">14. A Few Simple things to neve rforget</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge42ad1f" class="outline-2">
<h2 id="orge42ad1f"><span class="section-number-2">1</span> You are Product</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>let’s concern ourselves with arming you with
better means, methods and mechanisms to deflect and deal with shit that has
happened to you, is happening to you and will happen to you.</li>

<li>Let’s start with you. You are a product. You are a product with hope
attached to it. What does that mean? It means that, one day, you are meant to
become this awesome, functional unit capable of choosing jobs, careers,
relationships, environments and economies on your own volition—that’s the
hope. The better the choices, the better the product you are—that’s the simple
law on the basis of which the world judges you.

<ul class="org-ul">
<li>‘Emotional responses’ is a garbage teacher, because as a kid, the
emotional intelligence is underdeveloped.</li>
</ul></li>

<li>Anyway, when the time comes, a lot of them will take complete
advantage of you, rid you of your emotional innocence and turn your world
upside down. It will most definitely happen, history tells you that, no matter
who you are or what you do—rich, talented, genius, pretty, strong, powerful,
polite, kind, or careful.</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-orga7b5bab" class="outline-2">
<h2 id="orga7b5bab"><span class="section-number-2">2</span> You know you want to be special</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Specialness is the badge of realisation you earn. It may seem very
simple to you, but this thinking can change the course of your life. Any
achievement dictates you have created or mastered something. This means
that not only did you gain in terms of knowledge, but you built habits of
discipline, hard work, prioritising and focusing—habits that will serve you in
almost all aspects of life.</li>
<li>becomes a reference point for yourself in the future—I was able to achieve
this, this is who I am— but also proves to yourself that you have what it takes
to be capable—I believe I can achieve anything I put my mind to.</li>

<li>Whatever the case may be, the right to feel special
must be earned and must only be yours to give. It shouldn’t belong to others
because:</li>
<li>Why am I special? What
have I done in my life?, and get a clear answer. In case you feel dissatisfied,
then you have the option to earn it. Nobody gives it to you, you have to take
it. But that’s the hard part, earning it.</li>
</ul>
</div>
</div>

<div id="outline-container-org51c3826" class="outline-2">
<h2 id="org51c3826"><span class="section-number-2">3</span> What Rejections do to us</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Rejections are Normal
<ul class="org-ul">
<li>Don&rsquo;t prove to orthers</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb38d529" class="outline-2">
<h2 id="orgb38d529"><span class="section-number-2">4</span> people are World</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>People are weird</li>
<li>To understand how to deal with something, you need to first figure out what
it is you’re dealing with</li>
<li>the difference between &rsquo;knowing&rsquo; and &rsquo;understanding&rsquo;</li>
<li>Your perception of something creates expectations from them</li>
<li>when you meet someone
<ul class="org-ul">
<li>data is king</li>
<li>people are weird</li>
<li>we live in era of advertising and sale</li>
<li></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org5a3c30e" class="outline-2">
<h2 id="org5a3c30e"><span class="section-number-2">5</span> Do Failures mess you up?</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org29960ed" class="outline-3">
<h3 id="org29960ed"><span class="section-number-3">5.1</span> How Not To Deal with failures</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>I am a fucking idiot, I am nothing, I am a loser, I don’t
deserve anything, I deserve to die. In many cases, these feelings are
accompanied by fear of your parents’ wrath, friends’</li>
<li>This chain of self-harm needs to be broken with the knowledge that failures,
 losses and rejections are normal, and a solution that directs all those highly
powerful negative emotions into something useful</li>
</ul>
</div>
</div>
<div id="outline-container-orgba78025" class="outline-3">
<h3 id="orgba78025"><span class="section-number-3">5.2</span> How Winning is done mentally</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>You wanna do this, right?
This may seem like a very simple question, but, my friend, there is a
difference between wanting to do something and having to do something.
Most people in this world are doing what they do not because they want to,
but because they have to. Having to do something becomes a duty you have
to fulfil. Wanting to do something is a choice. Therefore, to win, the very
first thing you need to clarify in your mind is, do you really wanna do this?</li>
</ul>
</div>
<div id="outline-container-org44fc371" class="outline-4">
<h4 id="org44fc371"><span class="section-number-4">5.2.1</span> People are successful number of reasons:</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>A hunger for money , status , power</li>
<li>a hunger to avoid poverty , desperation , conditions you wouldn&rsquo;t
want to go back to ever again</li>
<li>a hunger to prove in your own eyes that you are capable (which would
be the concept of being special)</li>
<li>a hunger to provide for those whom you love and are dependent on you</li>
</ul>


<p>
Success is a matter of choice
</p>
<ul class="org-ul">
<li>What traditional winning looks like
this is basically how society crowns a
winner. The results of any competition declare a winner and the losers.
Society celebrates the winner and ignores the losers</li>
<li>How real winning works
one wins after having failed time after time. Theessence behind real winning is not giving up, no matter what badges and
medals society is handing out. When it comes to your ‘heroes’ and those who
define success and hard work for you, you see them the same way</li>
</ul>
</div>
</div>
</div>
