posts/TheRudestBook.org
** HOW WINNING IS DONE PRACTICALLY
You want to be special. This specialness is not about being superficial, it is
about being capable
- Utility asks you: what’s the use of what you are learning? In how many
  areas, fields of study and practices can it be implemented? How much self-
  belief does this learning generate in you? How much self-value does it
  provide? Does it have value in the long term, in the market? And lastly, at
  what point does whatever you are learning start to have real utility in terms of
  success? Basically, where do you stand right now? Thinking in terms of
  utility makes you realise that there is a real world out there, away from your
  frog-well, with real competition, and the trophies you may be collecting are
  mere indicators that you are on the right path, but you haven’t actually won.

- Opportunity asks you: how can you use what you are learning? How many
  doors will it open for you? In how many ways can you capitalise on this
  skill? How many opportunities does it have in the marketplace? What’s the
  full potential of this skill if learned until you are an expert? Where is the
  geographic hub for opportunities for this skill? Thinking in terms of
  opportunity gives you ambition. Ambition gives you seriousness. With
  ambitious goals, the nature of its utility in your mind is revised and reset as
  well.

- Ability asks you: how well can you do what you are learning? Do you have a
  natural talent for this? Are you able to learn this faster than others? Are you
  slower than others? If yes, then despite being slower, are you able to beat the
  competition or stand on par by working harder than them? Success cares
  about nothing but results. Are you able to think creatively, which means can
  you create new opportunities from the existing ones? Are you able to think
  cleverly? Thinking in terms of abilities makes you aware of where you stand
  right now and where your ambition requires you to be standing.
** FAILURES TEACH YOU HOW TO WIN THE WAR
- failures are normal
- First, you take ownership of the failure. It’s very different from acting as
  if you have been stung by failure. Both are similar realisations, but come
  from different points of view. The first makes you responsible, the other a
  victim. Instead of finding tendencies, people and relationships to blame, you
  make yourself fully responsible for that failure. This is step one of the
  investigation. I deserve this. Whatever impact this failure causes, I deserve
  and take responsibility for it. Once you take ownership, it becomes your
  fuck-up. You are not a victim, it didn’t happen to you, you caused it. Once
  you own it
- After ownership begins assessment: Why did I fail? Assessment
  produces findings about your abilities, habits, relationships and the people in
  your life. For example, what was your approach going into the competition—
  serious or lazy? Did your approach include following a plan, routine, daily
  rituals backed by strict discipline? Or was it just counting the months left and
  convincing yourself of bullshit like you’ve still got it under control? If your
  approach was serious, then should you have worked for more hours a day?
  What state of mind did you have the entire time? Was your focus clouded by
  emotional entanglements? Were you busy in the consumption of short-term
  pleasures? Or were you desperately running after getting laid or finding true
  love?
- And this is why failures are important—
  they teach you everything you need to win the war.
* Finding Love Can be a pain in the ass
who you are professionally ?
- what is my ambition ? (what do you want to become exactly ? where
  do you want to reach ?)
- what are my current goals ? (short-term and long term goals to
  actualise the ambition mentioned above)
- what is the routine I need to achieve my goals ? (Does't need
  explanation.)
- what are my dreams ? (why do you want to achieve that ?)
- what is the nature of the line of work I have chosen? (How demanding
  is it ? what's the scope for relaxation? at what age and with what skillset would you have achieved credible respect in your field or workplace?)
* How your self dies
** the Warning
Approval ==> when does it starts and how does it work ?
it start with you wanting to prove to yourself that you are capable
you start following them that does't make you intelligent beacause
followers can be clever, smart not intelligent
** The murder of individuality
don't seek for the approval of others it's cripple you
'self' is the individual in you.
It is the person you don't want to accept and ruyn away from to become a
different person. It is who you really are. It is who you are meant to know
better, empower an;d develop.
* Screw Happiness
** What is Self-Satisfaction ?
Your major struggle in life is to be happy; it is not to be satisfied
satisfation offer a state of mind called peacefulness. You would be at peace with
yourself. And this is also where the problem comes: to be at peace with yourself,
you will have to know your ‘self’ first
1. Self-Belief
  the knowledge of self produces self-belief
  It’s as simple as this: you are unsure and scared of what you don’t
  know; you’re confident and comfortable with things you know.
2. What does your self want ?
3. What you don't want !
  Furthermore, the knowledge of self produces the knowledge of what you
  don’t want, which is far more important than knowing what the self wants.
  Therefore, knowing well what your ‘self’ doesn’t want improves your
  decision-making abilities. This enables your view of yourself as an
  individual, and it also gives your identity uniqueness in the eyes of people.
4. What makes your self happy ?
  So, as a recap, what makes you happy is, one, doing things that are
  generally known to make people happy, and two, having theoretical ideas and
  fantasies regarding what would make you happy in the future.
  What makes your self happy is knowing clearly what activities give you
  joy, and what would give you satisfaction in the long run.
** Why do we chase after happiness like junkies ?
The problem with responding more to feeling good is that chances are
you may become a person who just focuses on feelings rather than thinking.
Feeling-based sounds something like: This makes me feel good,
therefore this is good. I want it. Thinking-based sounds like: Just because
something makes me feel good doesn’t mean it’s good. I will think about if I
really want it.
the fact that feelings change all the fucking time.
why most of us remain feeling-based happiness junkies:
   - In short, happiness is a by-product of life done right. And I
     hope this does not come as a surprise, but doing things right requires
     thinking, a lot of it.
