posts/TheRudestBook.org
*** How happiness screws you over and over!
1. Why am I not happy even though I have a great life?
   It’s because ‘the list of what makes you happy’ was decided back when you
   were a clueless, confused kid. And you stuck with that list because it did
   bring you momentary happiness from being accepted by and having
   relationships with fantasy people, fantasy experiences, and even achieving
   some milestones in your career for the approval of these fantasy people. But
   the focus on the self consistently remained dormant. Therefore, the result
   now is: you know how to be happy in the moment, but you aren’t satisfied
   because you have a very distant relationship with your ‘self’. You are still as
   clueless about who you are and what makes your ‘self’ happy as you were
   fifteen fucking years ago.
   As a side note, now you know when philosophers said Know thyself, it
   wasn’t some simple thing you didn’t need to think much about, it meant your
   fucking life.
2. I know I shouldn’t be with them, yet I can’t stop loving them. I
   can’t stop chasing after them. I can’t move on from that person.
   You can’t because a part of you is genuinely convinced that their union with
   your existence brings you the ultimate happiness. You feel that way because
   of the happiness that you once felt with them, which according to your mind
   is ‘the best feeling ever’. And because your goal in life is to be happy, and
   you currently don’t know of any other happiness better than what you felt
   with them, you obsess over them even though their presence is currently
   brutalising you with pain. If you miss them, it’s because they made you
   happy once. You miss that particular happiness, not them really. You will
   disregard their existence the moment you find it with another person. It’s
   because you are a happiness-junkie, that hit of happiness is much more
   valuable to you than your self-respect, mental health and the overall
   peacefulness in your life. So you say, fuck it, and keep going after that hit.
3. I know I should be working hard, but I waste my day doing
   bullshit things on my phone, being lazy and useless. And because
   of that I am filled with regret.
   You don’t work, because whatever you do instead of working makes you
   happy. It’s as simple as that. You being lazy does not mean you are dead in
   those moments. You are still working towards feeling great, quite actively so,
   by watching some comedy, drama, commentary, news, animal rescue videos,
   or whatever it is that you watch. You do work a lot—except it’s in the
   direction of gathering information which is of no use to your real work. So, a
   correct way to voice your displeasure is, I was unproductive, not, I didn’t do
   anything, because you did plenty of things, they were all just complete shit in
   terms of productivity. Things that add betterment to your life aren’t about
   making you happy, they’re about hard work. And you consciously choose
   momentary happiness over the betterment of your life because you are
   fucking addicted to being happy. In short, fuck life in the long term so I can
   be happy in the moment, is what you do.
4. I can’t say ‘no’ to people. Because of this, people often impose
   themselves on my wants and feelings and take advantage of my
   niceness.
   You can’t say ‘no’ because you can’t afford to make people unhappy. If they
   are unhappy with you, you are unhappy, and you want to be happy. You may
   tell others: I became unhappy because I didn’t get to do what I wanted, but
   the real story doesn’t stop there. What you don’t tell them is that the
   unhappiness vanishes the moment you see others being happy with you,
   despite the fact that you still didn’t get to do what you wanted. People being
   happy with you gives you so much pleasure that it feels like a much bigger
   reward than what you would feel if you stood up for yourself and said ‘no’.
   In short, because happiness is your priority, self-respect is ignored. And that
   is why, even though you complain to people about how unhappy it makes
   you, you keep repeating it, especially with people you desperately want to
   make happy. And you may do that at the cost of working overtime, sleeping
   less than planned, disrupting your own plans entirely, all because it gives you
   a great burst of pleasure for having ‘helped them’.
5. I am a dumbass because I have no idea what I want to do, and
   others are doing so much better than me.
   You are unhappy because others are doing better than you, in which case you
   would be happy if you were doing better than others. At any point, the source
   of your happiness and unhappiness rests in comparison to others. The act of
   comparing yourself has its basis in nothing but simple observation. A
   comparison could be triggered from seeing anything and anybody. It could be
   as vague as comparing yourself to a celebrity, a person you have met for the
   first time, or a person you have only heard about from others. From that, you
   conclude: They are better than me. How fucking dumb is that?
   It is not a comparison of data as much as it is of your perception of
   them. It is you drowning in sorrow because you have assumed they have
   something that you don’t, and that something would make you happy. These
   assumptions exist only because you have no idea what would make your
   ‘self’ happy.
   And because you don’t know that, the entire focus of your mind is on
   the outside, instead of looking inward for the answers. You are busy wanting
   what others have, learning what makes others happy, copying the lifestyles
   of others, coveting what you don’t have, and as a result developing a deep
   sense of disregard and ungratefulness towards what you do have.
6. Life was so much fun back then, life was great. I wish we could
   go back and live like that forever!
   The thing is, you were the happiest at your stupidest self—when you were
   young, in college, school, with your friends. You were experimenting with
   rebellion against structure, engaging in activities that produced rewards (like
   gaming), entertainment (with friends) and pleasure (partying, dating, alcohol,
   weed, fun). What you don’t realise is that, at that time, you could afford that
   experimentation. There was no real structure. You were free of any
   responsibilities, duties and consequences. You were in a safe environment.
   Now, you are not. What worked then won’t work now because the rules,
   environment and your age have changed, but your want to be happy has not.
   This explains the confusion as to why the same degree of happiness is not
   reachable anymore; hence, you blame ‘growing up’ for it.
   If ‘growing up’ was the problem, then you are suggesting a life without
   responsibilities, duties and consequences is better, and that is called
   escapism. As a kid, your reality was structurally designed to keep you as free
   as possible, therefore those wants worked. That reality was manipulated, the
   current one is not. Ask any person whose life growing up was a continuous
   battle with tragedy, troubles and struggle if they wish to go back, and you
   will know the difference. Your responsibilities, duties and consequences pose
   as a problem to you because you are a grown-person with the wants of a
   clueless kid—to be happy all the time.
**** All of the above problems revolve around four things:
Making yourself happy.
Making others happy to make yourself happy.
Making yourself sad because others are presumably happy.
Making yourself sad because you used to be happy.
*Summary : You have to say, fuck happiness. I don’t want to be happy, I
want to be satisfied in life. I want self-satisfaction.*
