posts/TheRudestBook.org
* Choose Satisfaction, not happiness
Fair argument on the outside, but what it lacks is choice. Manipulation
tends to seriously fuck with your ability to make a rational choice.
Manipulation feeds on weaknesses and vulnerabilities. Anything that is built
on targeting your weakness and naivety, and making you its customer, is
fucking vile because it doesn’t care about you at all. It doesn’t care about
your age, maturity and personal development either. You are a user—that’s
all it cares about.
Most of our wants come from:
- Whatever society has made you believe is awesome (conditioning)
- whatever you see and have leaerned that others want ( following others )
- whatever appears to be exciting to you ( your impulse )


Whatever your wants are, let's divide them into two categories: the first
would be wants that contribute to long-term results; the second would be
wants that bring you momentary happiness. Let's call the first category
*value*, because they bring value to your life, and lets call the second
*interest*, because they deal with your actual interests in life.
** Long-Term Happiness (Value)
1. Stability
   they make you aware what you want from the day, what you don't want
   the help you get closer to peacefulness
2. Cultivaiton
   doing things helps in cultivation of your mind. they give you reference
   points and clarity about 'self'
   The point of cultivation is not storing knowledge in your mind so you
   can use it later to impress people. That might make you knowledgeable, not
   intelligent. It’s pointless if it doesn’t reflect in your actions. Cultivation of the
   mind means keeping what makes you think and applying what makes sense.

Any of your wants that serve stability and cultivaiton majorly influence
how you think in life, the choices you make and how you see things.
** Short-Term Happiness (Insterest)
* Screw Pleasing People
** Do you care what others think about you ??
Here’s the truth: nobody cares. Nobody cares unless they have a
personal motive to care. You have rarely looked at how things are from the
point of view of others. If you did, you’d realise that the people you want to
impress can barely afford to think about you.
However, important and powerful people do have the power of offering
opportunities, which must be something you are interested in because of
which you want to impress them. Here’s a simple rule: fuck whatever gossip
goes around in their mind regarding you. Gossip gets discarded and replaced
every day. Lasting impressions are formed by things they cannot ignore. So,
impress with abilities, not appearance. Abilities cannot be ignored; if one
person happens to do so, there are always going to be other takers.
You have to understand, people may not care about you, but they do
make observations. And their approval is nothing more than one of those
many observations. They are not just sitting and thinking about you, but that
observation does sit at the back of their head, with chances of making a
connection with an opportunity. And opportunities as a reward are much
better than appreciation.
Appreciation gives you momentary pleasure. Opportunities get you
somewhere in life. So apply common sense and tell me, which is better?
You have to understand, people may not care about you, but they do
make observations. And their approval is nothing more than one of those
many observations. They are not just sitting and thinking about you, but that
observation does sit at the back of their head, with chances of making a
connection with an opportunity. And opportunities as a reward are much
better than appreciation.
Appreciation gives you momentary pleasure. Opportunities get you
somewhere in life. So apply common sense and tell me, which is better?
You are accumulating self-worth from the appreciation of others. That
is the root of your problem. Not people who are better than you.
** Do you rely on people for the motivation ??
Think of the time you attended an event, seminar or conference related
to your work or studies. There you met and talked to people who are experts
in the field, who have superior skills and more success than you. It gave you
immense exposure. While you were there, you felt and thought:
- I am going to be great in this too.
- Why wasn’t I working hard all this while? If I were, I would have been
impressive too.
Upon returning, you start planning as you experience a surge of inspiration
growing in you, and you think about the things you have been wasting your
time on. You start cursing, criticising and blaming them. You decide in the
moment that you are going to be making changes now and become serious
towards work.
And in about ten days or so, you go back to doing what you were doing
previously. The new-found motivation is gone. Do you know why that is?
Well, at that event, three things happened:
- In that room, you saw versions of what you can become in terms of
success and skills.
- Your self-worth took a severe beating as you weren’t the impressive
somebody people wanted to talk to or talk about. You were an
unknown who talked to impressive somebodies.
- You met with several people who are competent and awesome in
everybody’s eyes in that room. Therefore, naturally, you wanted to be
approved and accepted by them. One day they’re gonna know.
Hence, the motivation was created by a) wanting success for yourself b)
wanting success so you can show to others that you are worthy and c)
wanting approval and acceptance of the successful people you met.
Two-thirds of your fucking motivation came from the outside, only
one-third from inside. When these others left your mind in ten days or so, so
did two-thirds of your motivation, and you went back to doing the same
things you used to before.
And then you are sitting with your phone in your hand, wondering why
you are not motivated anymore.
As a result, you start glorifying these events in your mind, romanticising
the people you met as though they were perfect beings, and blaming more
strongly the people in your life as if they have tied your hands. It’s because of
them I don’t work hard.
Your problem is your motivation comes from the outside, and you have
labelled outsiders as the ideal source for your motivation. If you want to be
crazily motivated to do anything, a hundred per cent of the reasons to do that
thing will have to come from the inside. Words like ‘others’ and ‘them’ will
have to be replaced by ‘myself’. It should not be I wanna show them, but I
wanna show myself; not I want to be great so they will be impressed, but I
want to be great so I can be satisfied with myself. You have to keep this word
in mind: myself. That’s who you are; that’s the one who gets affected; and
that’s the one whose life it is.
If you are relying on others, you are indirectly controlled by others. And
others don’t give a shit about you.
Now, how do we achieve this? Buckle up, my friend, we’re gonna take
the word ‘myself’ up a few notches and create a new foundational principle:
You are a nation. That’s how you will have to start seeing yourself from now
on. You are a nation in yourself, and I am going to prove it to you.
* Screw you Heroes
