posts/TheRudestBook.html
<div id="outline-container-orgb1607d2" class="outline-2">
<h2 id="orgb1607d2"><span class="section-number-2">9</span> Choose Satisfaction, not happiness</h2>
<div class="outline-text-2" id="text-9">
<p>
Fair argument on the outside, but what it lacks is choice. Manipulation
tends to seriously fuck with your ability to make a rational choice.
Manipulation feeds on weaknesses and vulnerabilities. Anything that is built
on targeting your weakness and naivety, and making you its customer, is
fucking vile because it doesn’t care about you at all. It doesn’t care about
your age, maturity and personal development either. You are a user—that’s
all it cares about.
Most of our wants come from:
</p>
<ul class="org-ul">
<li>Whatever society has made you believe is awesome (conditioning)</li>
<li>whatever you see and have leaerned that others want ( following others )</li>
<li>whatever appears to be exciting to you ( your impulse )</li>
</ul>


<p>
Whatever your wants are, let&rsquo;s divide them into two categories: the first
would be wants that contribute to long-term results; the second would be
wants that bring you momentary happiness. Let&rsquo;s call the first category
<b>value</b>, because they bring value to your life, and lets call the second
<b>interest</b>, because they deal with your actual interests in life.
</p>
</div>
<div id="outline-container-orgcd45e27" class="outline-3">
<h3 id="orgcd45e27"><span class="section-number-3">9.1</span> Long-Term Happiness (Value)</h3>
<div class="outline-text-3" id="text-9-1">
<ol class="org-ol">
<li>Stability
they make you aware what you want from the day, what you don&rsquo;t want
the help you get closer to peacefulness</li>
<li>Cultivaiton
doing things helps in cultivation of your mind. they give you reference
points and clarity about &rsquo;self&rsquo;
The point of cultivation is not storing knowledge in your mind so you
can use it later to impress people. That might make you knowledgeable, not
intelligent. It’s pointless if it doesn’t reflect in your actions. Cultivation of the
mind means keeping what makes you think and applying what makes sense.</li>
</ol>

<p>
Any of your wants that serve stability and cultivaiton majorly influence
how you think in life, the choices you make and how you see things.
</p>
</div>
</div>
<div id="outline-container-org4d07cce" class="outline-3">
<h3 id="org4d07cce"><span class="section-number-3">9.2</span> Short-Term Happiness (Insterest)</h3>
</div>
</div>
<div id="outline-container-org49abae6" class="outline-2">
<h2 id="org49abae6"><span class="section-number-2">10</span> Screw Pleasing People</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org9501469" class="outline-3">
<h3 id="org9501469"><span class="section-number-3">10.1</span> Do you care what others think about you ??</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Here’s the truth: nobody cares. Nobody cares unless they have a
personal motive to care. You have rarely looked at how things are from the
point of view of others. If you did, you’d realise that the people you want to
impress can barely afford to think about you.
However, important and powerful people do have the power of offering
opportunities, which must be something you are interested in because of
which you want to impress them. Here’s a simple rule: fuck whatever gossip
goes around in their mind regarding you. Gossip gets discarded and replaced
every day. Lasting impressions are formed by things they cannot ignore. So,
impress with abilities, not appearance. Abilities cannot be ignored; if one
person happens to do so, there are always going to be other takers.
You have to understand, people may not care about you, but they do
make observations. And their approval is nothing more than one of those
many observations. They are not just sitting and thinking about you, but that
observation does sit at the back of their head, with chances of making a
connection with an opportunity. And opportunities as a reward are much
better than appreciation.
Appreciation gives you momentary pleasure. Opportunities get you
somewhere in life. So apply common sense and tell me, which is better?
You have to understand, people may not care about you, but they do
make observations. And their approval is nothing more than one of those
many observations. They are not just sitting and thinking about you, but that
observation does sit at the back of their head, with chances of making a
connection with an opportunity. And opportunities as a reward are much
better than appreciation.
Appreciation gives you momentary pleasure. Opportunities get you
somewhere in life. So apply common sense and tell me, which is better?
You are accumulating self-worth from the appreciation of others. That
is the root of your problem. Not people who are better than you.
</p>
</div>
</div>
<div id="outline-container-orgcb0c2d8" class="outline-3">
<h3 id="orgcb0c2d8"><span class="section-number-3">10.2</span> Do you rely on people for the motivation ??</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Think of the time you attended an event, seminar or conference related
to your work or studies. There you met and talked to people who are experts
in the field, who have superior skills and more success than you. It gave you
immense exposure. While you were there, you felt and thought:
</p>
<ul class="org-ul">
<li>I am going to be great in this too.</li>
<li>Why wasn’t I working hard all this while? If I were, I would have been</li>
</ul>
<p>
impressive too.
Upon returning, you start planning as you experience a surge of inspiration
growing in you, and you think about the things you have been wasting your
time on. You start cursing, criticising and blaming them. You decide in the
moment that you are going to be making changes now and become serious
towards work.
And in about ten days or so, you go back to doing what you were doing
previously. The new-found motivation is gone. Do you know why that is?
Well, at that event, three things happened:
</p>
<ul class="org-ul">
<li>In that room, you saw versions of what you can become in terms of</li>
</ul>
<p>
success and skills.
</p>
<ul class="org-ul">
<li>Your self-worth took a severe beating as you weren’t the impressive</li>
</ul>
<p>
somebody people wanted to talk to or talk about. You were an
unknown who talked to impressive somebodies.
</p>
<ul class="org-ul">
<li>You met with several people who are competent and awesome in</li>
</ul>
<p>
everybody’s eyes in that room. Therefore, naturally, you wanted to be
approved and accepted by them. One day they’re gonna know.
Hence, the motivation was created by a) wanting success for yourself b)
wanting success so you can show to others that you are worthy and c)
wanting approval and acceptance of the successful people you met.
Two-thirds of your fucking motivation came from the outside, only
one-third from inside. When these others left your mind in ten days or so, so
did two-thirds of your motivation, and you went back to doing the same
things you used to before.
And then you are sitting with your phone in your hand, wondering why
you are not motivated anymore.
As a result, you start glorifying these events in your mind, romanticising
the people you met as though they were perfect beings, and blaming more
strongly the people in your life as if they have tied your hands. It’s because of
them I don’t work hard.
Your problem is your motivation comes from the outside, and you have
labelled outsiders as the ideal source for your motivation. If you want to be
crazily motivated to do anything, a hundred per cent of the reasons to do that
thing will have to come from the inside. Words like ‘others’ and ‘them’ will
have to be replaced by ‘myself’. It should not be I wanna show them, but I
wanna show myself; not I want to be great so they will be impressed, but I
want to be great so I can be satisfied with myself. You have to keep this word
in mind: myself. That’s who you are; that’s the one who gets affected; and
that’s the one whose life it is.
If you are relying on others, you are indirectly controlled by others. And
others don’t give a shit about you.
Now, how do we achieve this? Buckle up, my friend, we’re gonna take
the word ‘myself’ up a few notches and create a new foundational principle:
You are a nation. That’s how you will have to start seeing yourself from now
on. You are a nation in yourself, and I am going to prove it to you.
</p>
</div>
</div>
</div>
<div id="outline-container-org53cf5aa" class="outline-2">
<h2 id="org53cf5aa"><span class="section-number-2">11</span> Screw you Heroes</h2>
<div class="outline-text-2" id="text-11">
</div>
