posts/TheRudestBook.org
** Heroes
Well, these are the first type of people you need to detach yourself from in your mind if you want to be your own person.
** Why do we love Heroes ?
No wonder humans are generations of cattle led by wolves.
- Political issues: They are the bad guys, we are the good guys,
  vote for us because we will keep you safe from the bad guys.
- Personal opinions on people you meet: He looks like a good guy.
  It is actually the foundation of our first impressions—somebody is either good or bad
- Your perception of structures of power, fame and money: The government is bad.
  Scientists are good. People who work on Wall Street are bad. Teachers are good.
  Famous actors are good because they play nice people in movies and
  TV shows and because they support causes.
** A society that funtion on 'good' and 'bad' is dumb ?
This means no matter how glamorous, impressive, commanding, rich, celebrated, famous and respected they are, they too have feelings and flaws just like you do.
They too cry, bitch and moan like everybody else. They too struggle to
do many things and face disappointments. They too have inner demons. They
also wonder: what’s the point of everything ?

All right, but what about our forefathers, freedom fighters, authors,
scientists, inventors, philosophers, and great historical figures who paved the
way for freedom, equality and justice for future generations? Those who
annulled harmful practices, fought ignorance, prejudice and oppression? Are
we to believe they were not great, perfect men and women? Are the pioneers
of new-age inventions, technology and advancement not worthy of being
followed as perfect examples? Even the ones who lead with principles of
non-violence and total inclusiveness?

And you cannot change and become who they are just because you
would like to. It doesn’t work like that. You will remain who you are, so it’s
better you get in touch with that and work on it. What you can do is take what
you admire about them and try to bring that into your behaviour and thinking
as well. You can try that with the help of self-control.
** What it means to admire someone
When somebody is your hero, you take on the mantle of being their follower.
With that mantle now comes the responsibility of proving why they are
worthy of being followed and defending them when somebody disagrees with
you or attacks them. You might think, I don’t have to defend anybody, it’s my
choice, I will follow whoever I want.
That’s bullshit. The truth is that your choice to follow them now
represents your intelligence. And failing to defend them makes you look like
an idiot.

You are a fan of their extraordinary acts and the products of their talents, not
their lives. Learn to differentiate. What you have is a fascination for their
lives. Without their achievements, you wouldn’t have even known their names.

So, learn from everybody. Maybe that is why we label people as heroes—
because we are flawed. We need heroes to believe in our hearts that we can
be better, so there is hope for us too. Well, the fact that you want to be better
is the hope. But for that, you don’t have to be like anybody, you already have
your ‘self’. There is only one person who should give you approval,
acceptance and self-worth, and that is you. You are a nation, my friend. Build
a self-reliant one.
* The Pieces of shit Online
** THRUTH ABOUT SOCIAL MEDIA INFLUENCERS
- We live in a world where it has always been the norm to gather a
  following. This means that, throughout history, a few people have
  always tried to gain a following for themselves for several reasons: to
  acquire power, wealth, influence, popularity and control. All right?
- People by nature are aspirational beings. Aspirational content means selling you things that you don’t have but would like to have. We havethese wants as we live under the impression that these things will make us happy.
  The truth is, we think this way because we have no
  fucking idea what would make our ‘self’ happy. So we chase after
  bullshit ideas of happiness being sold to us by YouTubers and
  vloggers.
- Since you are shown only what they wnat you to see, you assume it is real. This is where you develop the why am i not like them syndrome.

Therefore, the more honest a person, the more you admire them. The
less honest a person, the more you follow them.

Now, sometimes, these famous people shine a light on mental health
issues and causes, which is great. They are powerful people, so their message
has a huge audience. Whether they are doing it to build their public image or
not, it doesn’t matter. It helps the issue.

But when they talk about personal issues, like break-ups or hardships of
any type, we lose our minds. If being aspirational didn’t have such a
ridiculous market value, you would have known they go through exactly the
same problems as you do, with the exception of money-related ones. You are
surprised because your perception of them is they are perfect beings from
outer space.

Now, here’s something very interesting: An opposite reaction is created
when the same people have private information leaked about them. They get
involved in scandals, are found hiding money, cheating on their partners,
mistreating people around them, or doing something that shatters that image
of perfect beings.

How many times
are you going to fall for the same trick?
It reveals the intensity of your emotional involvement in their personal
life—about which you know absolutely nothing, but have assumed
everything. Why don’t you ignore the persona they are selling and screw the
assumptions your mind is creating, and only admire what made you notice
them—entertainment, art, intelligence, skills. They are people. Their skill in a
few things doesn’t preclude them from having flaws, desires, urges, as all
people do. Screw the aspirational value, I wish I could be like them; they are
** HOW TO SAVE YOURSELF FROM THIS BULLSHIT
Here’s what you do whenever you feel like doing that: Admire, never
follow. Nobody can discredit their acts of charity and positivity, but you have
no idea who they are as a person—none—except what is in their control and
power to sell.
Let’s really compare the choices: perfect people or self

which make you
assume that these people are fucking superheroes. Just chill with the
assumptions, mate. This whole game is just their advertising and our stupid
* How to Think
who the fuck even is that guy! Don’t you care? Are
you selfish? Please pretend it matters to you so I can share this clever
opinion I’ve stolen from somebody and feel superior? Please debate me.


All of the above teach you what to think. And this is how we appear
competent in this world—none of which comes from ‘how to think’.
* A Few Simple things to neve rforget
Empowering and degrading yourself are two sides of the same coin.
