posts/TheRudestBook.html
<div id="outline-container-org76e0d22" class="outline-3">
<h3 id="org76e0d22"><span class="section-number-3">11.1</span> Heroes</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Well, these are the first type of people you need to detach yourself from in your mind if you want to be your own person.
</p>
</div>
</div>
<div id="outline-container-org798478c" class="outline-3">
<h3 id="org798478c"><span class="section-number-3">11.2</span> Why do we love Heroes ?</h3>
<div class="outline-text-3" id="text-11-2">
<p>
No wonder humans are generations of cattle led by wolves.
</p>
<ul class="org-ul">
<li>Political issues: They are the bad guys, we are the good guys,
vote for us because we will keep you safe from the bad guys.</li>
<li>Personal opinions on people you meet: He looks like a good guy.
It is actually the foundation of our first impressions—somebody is either good or bad</li>
<li>Your perception of structures of power, fame and money: The government is bad.
Scientists are good. People who work on Wall Street are bad. Teachers are good.
Famous actors are good because they play nice people in movies and
TV shows and because they support causes.</li>
</ul>
</div>
</div>
<div id="outline-container-org1ede111" class="outline-3">
<h3 id="org1ede111"><span class="section-number-3">11.3</span> A society that funtion on &rsquo;good&rsquo; and &rsquo;bad&rsquo; is dumb ?</h3>
<div class="outline-text-3" id="text-11-3">
<p>
This means no matter how glamorous, impressive, commanding, rich, celebrated, famous and respected they are, they too have feelings and flaws just like you do.
They too cry, bitch and moan like everybody else. They too struggle to
do many things and face disappointments. They too have inner demons. They
also wonder: what’s the point of everything ?
</p>

<p>
All right, but what about our forefathers, freedom fighters, authors,
scientists, inventors, philosophers, and great historical figures who paved the
way for freedom, equality and justice for future generations? Those who
annulled harmful practices, fought ignorance, prejudice and oppression? Are
we to believe they were not great, perfect men and women? Are the pioneers
of new-age inventions, technology and advancement not worthy of being
followed as perfect examples? Even the ones who lead with principles of
non-violence and total inclusiveness?
</p>

<p>
And you cannot change and become who they are just because you
would like to. It doesn’t work like that. You will remain who you are, so it’s
better you get in touch with that and work on it. What you can do is take what
you admire about them and try to bring that into your behaviour and thinking
as well. You can try that with the help of self-control.
</p>
</div>
</div>
<div id="outline-container-org55f5d8a" class="outline-3">
<h3 id="org55f5d8a"><span class="section-number-3">11.4</span> What it means to admire someone</h3>
<div class="outline-text-3" id="text-11-4">
<p>
When somebody is your hero, you take on the mantle of being their follower.
With that mantle now comes the responsibility of proving why they are
worthy of being followed and defending them when somebody disagrees with
you or attacks them. You might think, I don’t have to defend anybody, it’s my
choice, I will follow whoever I want.
That’s bullshit. The truth is that your choice to follow them now
represents your intelligence. And failing to defend them makes you look like
an idiot.
</p>

<p>
You are a fan of their extraordinary acts and the products of their talents, not
their lives. Learn to differentiate. What you have is a fascination for their
lives. Without their achievements, you wouldn’t have even known their names.
</p>

<p>
So, learn from everybody. Maybe that is why we label people as heroes—
because we are flawed. We need heroes to believe in our hearts that we can
be better, so there is hope for us too. Well, the fact that you want to be better
is the hope. But for that, you don’t have to be like anybody, you already have
your ‘self’. There is only one person who should give you approval,
acceptance and self-worth, and that is you. You are a nation, my friend. Build
a self-reliant one.
</p>
</div>
</div>
</div>
<div id="outline-container-org2d5a87f" class="outline-2">
<h2 id="org2d5a87f"><span class="section-number-2">12</span> The Pieces of shit Online</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgea40f5b" class="outline-3">
<h3 id="orgea40f5b"><span class="section-number-3">12.1</span> THRUTH ABOUT SOCIAL MEDIA INFLUENCERS</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>We live in a world where it has always been the norm to gather a
following. This means that, throughout history, a few people have
always tried to gain a following for themselves for several reasons: to
acquire power, wealth, influence, popularity and control. All right?</li>
<li>People by nature are aspirational beings. Aspirational content means selling you things that you don’t have but would like to have. We havethese wants as we live under the impression that these things will make us happy.
The truth is, we think this way because we have no
fucking idea what would make our ‘self’ happy. So we chase after
bullshit ideas of happiness being sold to us by YouTubers and
vloggers.</li>
<li>Since you are shown only what they wnat you to see, you assume it is real. This is where you develop the why am i not like them syndrome.</li>
</ul>

<p>
Therefore, the more honest a person, the more you admire them. The
less honest a person, the more you follow them.
</p>

<p>
Now, sometimes, these famous people shine a light on mental health
issues and causes, which is great. They are powerful people, so their message
has a huge audience. Whether they are doing it to build their public image or
not, it doesn’t matter. It helps the issue.
</p>

<p>
But when they talk about personal issues, like break-ups or hardships of
any type, we lose our minds. If being aspirational didn’t have such a
ridiculous market value, you would have known they go through exactly the
same problems as you do, with the exception of money-related ones. You are
surprised because your perception of them is they are perfect beings from
outer space.
</p>

<p>
Now, here’s something very interesting: An opposite reaction is created
when the same people have private information leaked about them. They get
involved in scandals, are found hiding money, cheating on their partners,
mistreating people around them, or doing something that shatters that image
of perfect beings.
</p>

<p>
How many times
are you going to fall for the same trick?
It reveals the intensity of your emotional involvement in their personal
life—about which you know absolutely nothing, but have assumed
everything. Why don’t you ignore the persona they are selling and screw the
assumptions your mind is creating, and only admire what made you notice
them—entertainment, art, intelligence, skills. They are people. Their skill in a
few things doesn’t preclude them from having flaws, desires, urges, as all
people do. Screw the aspirational value, I wish I could be like them; they are
</p>
</div>
</div>
<div id="outline-container-org61b69db" class="outline-3">
<h3 id="org61b69db"><span class="section-number-3">12.2</span> HOW TO SAVE YOURSELF FROM THIS BULLSHIT</h3>
<div class="outline-text-3" id="text-12-2">
<p>
Here’s what you do whenever you feel like doing that: Admire, never
follow. Nobody can discredit their acts of charity and positivity, but you have
no idea who they are as a person—none—except what is in their control and
power to sell.
Let’s really compare the choices: perfect people or self
</p>

<p>
which make you
assume that these people are fucking superheroes. Just chill with the
assumptions, mate. This whole game is just their advertising and our stupid
</p>
</div>
</div>
</div>
<div id="outline-container-orgf7af2a0" class="outline-2">
<h2 id="orgf7af2a0"><span class="section-number-2">13</span> How to Think</h2>
<div class="outline-text-2" id="text-13">
<p>
who the fuck even is that guy! Don’t you care? Are
you selfish? Please pretend it matters to you so I can share this clever
opinion I’ve stolen from somebody and feel superior? Please debate me.
</p>


<p>
All of the above teach you what to think. And this is how we appear
competent in this world—none of which comes from ‘how to think’.
</p>
</div>
</div>
<div id="outline-container-orgb191243" class="outline-2">
<h2 id="orgb191243"><span class="section-number-2">14</span> A Few Simple things to neve rforget</h2>
<div class="outline-text-2" id="text-14">
<p>
Empowering and degrading yourself are two sides of the same coin.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: AkashRaj</p>
<p class="date">Created: 2021-07-21 Wed 23:16</p>
</div>
</body>
</html>
